src/InformationRegisters/Трудозатраты/Трудозатраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Трудозатраты</name>
  <resources>
    <name>ЗатраченоВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Затрачено</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>CatalogRef.Задачи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Трудозатраты/RecordSetModule.bsl
#Если Сервер Тогда

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Префиксы = Новый Массив;
	Префиксы.Добавить("Затрачено");
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Запись.ЗатраченоВСекундах = ПолучитьЗатрачено(Запись.Задача);
		
		Для Каждого Префикс Из Префиксы Цикл
			ИзСекунд = ОбщегоНазначенияКлиентСервер.ИзСекунд(Запись[Префикс + "ВСекундах"]);
			Запись[Префикс] = ОбщегоНазначенияКлиентСервер.ПредставлениеТрудозатрат(, ИзСекунд.Часов, ИзСекунд.Минут);
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьЗатрачено(Задача) 
	
	Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(Замеры.Затрачено) КАК Затрачено
	|ИЗ
	|	Справочник.Замеры КАК Замеры
	|ГДЕ
	|	Замеры.Владелец = &Задача
	|	И НЕ Замеры.Владелец.Проект.ЛичноеВремя";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Результат = ВыборкаДетальныеЗаписи.Затрачено;
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли
